{"backend": "tensorflow", "keras_version": "2.2.2", "class_name": "Model", "config": {"input_layers": [["input_1", 0, 0]], "layers": [{"inbound_nodes": [], "name": "input_1", "class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 720, 1280, 3], "name": "input_1", "sparse": false}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "lambda_1", "class_name": "Lambda", "config": {"name": "lambda_1", "function": ["4wEAAAAAAAAAAQAAAAsAAABDAAAAc0kAAAB0AABqAQB8AABkAQBkAgBkAwBkAwBkAgBnBABkBABk\nAgBkBQBkBQBkAgBnBABkBgBkAgBkAgBkAgBkAgBnBABkBwBkCACDAQRTKQlO2gZrc2l6ZXPpAQAA\nAOl4AAAA2gdzdHJpZGVz6VAAAADaBXJhdGVz2gdwYWRkaW5n2gVWQUxJRCkC2gJ0ZtoVZXh0cmFj\ndF9pbWFnZV9wYXRjaGVzKQHaAXipAHIMAAAA+gh0cmFpbi5wedoIPGxhbWJkYT5pAAAAcwIAAAAG\nAQ==\n", null, null], "output_shape_type": "raw", "output_shape": null, "arguments": {}, "function_type": "lambda", "trainable": true}}, {"inbound_nodes": [[["lambda_1", 0, 0, {}]]], "name": "reshape_1", "class_name": "Reshape", "config": {"name": "reshape_1", "trainable": true, "target_shape": [8, 15, 120, 120, 3]}}, {"inbound_nodes": [[["reshape_1", 0, 0, {}]]], "name": "reshape_2", "class_name": "Reshape", "config": {"name": "reshape_2", "trainable": true, "target_shape": [120, 120, 120, 3]}}, {"inbound_nodes": [[["reshape_2", 0, 0, {}]]], "name": "time_distributed_1", "class_name": "TimeDistributed", "config": {"layer": {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_regularizer": null, "name": "conv2d_1", "activity_regularizer": null, "filters": 32, "padding": "same", "trainable": true, "bias_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "use_bias": true, "dilation_rate": [1, 1], "strides": [2, 2], "data_format": "channels_last"}}, "name": "time_distributed_1", "trainable": true}}, {"inbound_nodes": [[["time_distributed_1", 0, 0, {}]]], "name": "time_distributed_2", "class_name": "TimeDistributed", "config": {"layer": {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_1", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "momentum": 0.99, "trainable": true, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "center": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, "name": "time_distributed_2", "trainable": true}}, {"inbound_nodes": [[["time_distributed_2", 0, 0, {}]]], "name": "time_distributed_3", "class_name": "TimeDistributed", "config": {"layer": {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu6"}}, "name": "time_distributed_3", "trainable": true}}, {"inbound_nodes": [[["time_distributed_3", 0, 0, {}]]], "name": "time_distributed_4", "class_name": "TimeDistributed", "config": {"layer": {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_regularizer": null, "name": "conv2d_2", "activity_regularizer": null, "filters": 32, "padding": "same", "trainable": true, "bias_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "use_bias": true, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last"}}, "name": "time_distributed_4", "trainable": true}}, {"inbound_nodes": [[["time_distributed_4", 0, 0, {}]]], "name": "time_distributed_5", "class_name": "TimeDistributed", "config": {"layer": {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_2", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "momentum": 0.99, "trainable": true, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "center": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, "name": "time_distributed_5", "trainable": true}}, {"inbound_nodes": [[["time_distributed_5", 0, 0, {}]]], "name": "time_distributed_6", "class_name": "TimeDistributed", "config": {"layer": {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu6"}}, "name": "time_distributed_6", "trainable": true}}, {"inbound_nodes": [[["time_distributed_6", 0, 0, {}]]], "name": "time_distributed_7", "class_name": "TimeDistributed", "config": {"layer": {"class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_1", "activity_regularizer": null, "dilation_rate": [1, 1], "padding": "same", "trainable": true, "bias_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "data_format": "channels_last", "depthwise_constraint": null, "use_bias": true, "depth_multiplier": 1, "bias_constraint": null, "strides": [1, 1], "depthwise_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}}, "name": "time_distributed_7", "trainable": true}}, {"inbound_nodes": [[["time_distributed_7", 0, 0, {}]]], "name": "time_distributed_8", "class_name": "TimeDistributed", "config": {"layer": {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_3", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "momentum": 0.99, "trainable": true, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "center": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, "name": "time_distributed_8", "trainable": true}}, {"inbound_nodes": [[["time_distributed_8", 0, 0, {}]]], "name": "time_distributed_9", "class_name": "TimeDistributed", "config": {"layer": {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu6"}}, "name": "time_distributed_9", "trainable": true}}, {"inbound_nodes": [[["time_distributed_9", 0, 0, {}]]], "name": "time_distributed_10", "class_name": "TimeDistributed", "config": {"layer": {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_regularizer": null, "name": "conv2d_3", "activity_regularizer": null, "filters": 16, "padding": "same", "trainable": true, "bias_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "use_bias": true, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last"}}, "name": "time_distributed_10", "trainable": true}}, {"inbound_nodes": [[["time_distributed_10", 0, 0, {}]]], "name": "time_distributed_11", "class_name": "TimeDistributed", "config": {"layer": {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_4", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "momentum": 0.99, "trainable": true, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "center": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, "name": "time_distributed_11", "trainable": true}}, {"inbound_nodes": [[["time_distributed_11", 0, 0, {}]]], "name": "time_distributed_12", "class_name": "TimeDistributed", "config": {"layer": {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_regularizer": null, "name": "conv2d_4", "activity_regularizer": null, "filters": 96, "padding": "same", "trainable": true, "bias_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "use_bias": true, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last"}}, "name": "time_distributed_12", "trainable": true}}, {"inbound_nodes": [[["time_distributed_12", 0, 0, {}]]], "name": "time_distributed_13", "class_name": "TimeDistributed", "config": {"layer": {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_5", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "momentum": 0.99, "trainable": true, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "center": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, "name": "time_distributed_13", "trainable": true}}, {"inbound_nodes": [[["time_distributed_13", 0, 0, {}]]], "name": "time_distributed_14", "class_name": "TimeDistributed", "config": {"layer": {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu6"}}, "name": "time_distributed_14", "trainable": true}}, {"inbound_nodes": [[["time_distributed_14", 0, 0, {}]]], "name": "time_distributed_15", "class_name": "TimeDistributed", "config": {"layer": {"class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_2", "activity_regularizer": null, "dilation_rate": [1, 1], "padding": "same", "trainable": true, "bias_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "data_format": "channels_last", "depthwise_constraint": null, "use_bias": true, "depth_multiplier": 1, "bias_constraint": null, "strides": [2, 2], "depthwise_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}}, "name": "time_distributed_15", "trainable": true}}, {"inbound_nodes": [[["time_distributed_15", 0, 0, {}]]], "name": "time_distributed_16", "class_name": "TimeDistributed", "config": {"layer": {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_6", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "momentum": 0.99, "trainable": true, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "center": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, "name": "time_distributed_16", "trainable": true}}, {"inbound_nodes": [[["time_distributed_16", 0, 0, {}]]], "name": "time_distributed_17", "class_name": "TimeDistributed", "config": {"layer": {"class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "relu6"}}, "name": "time_distributed_17", "trainable": true}}, {"inbound_nodes": [[["time_distributed_17", 0, 0, {}]]], "name": "time_distributed_18", "class_name": "TimeDistributed", "config": {"layer": {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_regularizer": null, "name": "conv2d_5", "activity_regularizer": null, "filters": 24, "padding": "same", "trainable": true, "bias_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "use_bias": true, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last"}}, "name": "time_distributed_18", "trainable": true}}, {"inbound_nodes": [[["time_distributed_18", 0, 0, {}]]], "name": "time_distributed_19", "class_name": "TimeDistributed", "config": {"layer": {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_7", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "momentum": 0.99, "trainable": true, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "center": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, "name": "time_distributed_19", "trainable": true}}, {"inbound_nodes": [[["time_distributed_19", 0, 0, {}]]], "name": "time_distributed_20", "class_name": "TimeDistributed", "config": {"layer": {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_regularizer": null, "name": "conv2d_6", "activity_regularizer": null, "filters": 144, "padding": "same", "trainable": true, "bias_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "use_bias": true, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last"}}, "name": "time_distributed_20", "trainable": true}}, {"inbound_nodes": [[["time_distributed_20", 0, 0, {}]]], "name": "time_distributed_21", "class_name": "TimeDistributed", "config": {"layer": {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_8", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "momentum": 0.99, "trainable": true, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "center": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, "name": "time_distributed_21", "trainable": true}}, {"inbound_nodes": [[["time_distributed_21", 0, 0, {}]]], "name": "time_distributed_22", "class_name": "TimeDistributed", "config": {"layer": {"class_name": "Activation", "config": {"name": "activation_6", "trainable": true, "activation": "relu6"}}, "name": "time_distributed_22", "trainable": true}}, {"inbound_nodes": [[["time_distributed_22", 0, 0, {}]]], "name": "time_distributed_23", "class_name": "TimeDistributed", "config": {"layer": {"class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_3", "activity_regularizer": null, "dilation_rate": [1, 1], "padding": "same", "trainable": true, "bias_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "data_format": "channels_last", "depthwise_constraint": null, "use_bias": true, "depth_multiplier": 1, "bias_constraint": null, "strides": [1, 1], "depthwise_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}}, "name": "time_distributed_23", "trainable": true}}, {"inbound_nodes": [[["time_distributed_23", 0, 0, {}]]], "name": "time_distributed_24", "class_name": "TimeDistributed", "config": {"layer": {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_9", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "momentum": 0.99, "trainable": true, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "center": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, "name": "time_distributed_24", "trainable": true}}, {"inbound_nodes": [[["time_distributed_24", 0, 0, {}]]], "name": "time_distributed_25", "class_name": "TimeDistributed", "config": {"layer": {"class_name": "Activation", "config": {"name": "activation_7", "trainable": true, "activation": "relu6"}}, "name": "time_distributed_25", "trainable": true}}, {"inbound_nodes": [[["time_distributed_25", 0, 0, {}]]], "name": "time_distributed_26", "class_name": "TimeDistributed", "config": {"layer": {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_regularizer": null, "name": "conv2d_7", "activity_regularizer": null, "filters": 24, "padding": "same", "trainable": true, "bias_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "use_bias": true, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last"}}, "name": "time_distributed_26", "trainable": true}}, {"inbound_nodes": [[["time_distributed_26", 0, 0, {}]]], "name": "time_distributed_27", "class_name": "TimeDistributed", "config": {"layer": {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_10", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "momentum": 0.99, "trainable": true, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "center": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, "name": "time_distributed_27", "trainable": true}}, {"inbound_nodes": [[["time_distributed_27", 0, 0, {}], ["time_distributed_19", 0, 0, {}]]], "name": "add_1", "class_name": "Add", "config": {"name": "add_1", "trainable": true}}, {"inbound_nodes": [[["add_1", 0, 0, {}]]], "name": "time_distributed_28", "class_name": "TimeDistributed", "config": {"layer": {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_regularizer": null, "name": "conv2d_8", "activity_regularizer": null, "filters": 144, "padding": "same", "trainable": true, "bias_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "use_bias": true, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last"}}, "name": "time_distributed_28", "trainable": true}}, {"inbound_nodes": [[["time_distributed_28", 0, 0, {}]]], "name": "time_distributed_29", "class_name": "TimeDistributed", "config": {"layer": {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_11", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "momentum": 0.99, "trainable": true, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "center": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, "name": "time_distributed_29", "trainable": true}}, {"inbound_nodes": [[["time_distributed_29", 0, 0, {}]]], "name": "time_distributed_30", "class_name": "TimeDistributed", "config": {"layer": {"class_name": "Activation", "config": {"name": "activation_8", "trainable": true, "activation": "relu6"}}, "name": "time_distributed_30", "trainable": true}}, {"inbound_nodes": [[["time_distributed_30", 0, 0, {}]]], "name": "time_distributed_31", "class_name": "TimeDistributed", "config": {"layer": {"class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_4", "activity_regularizer": null, "dilation_rate": [1, 1], "padding": "same", "trainable": true, "bias_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "data_format": "channels_last", "depthwise_constraint": null, "use_bias": true, "depth_multiplier": 1, "bias_constraint": null, "strides": [2, 2], "depthwise_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}}, "name": "time_distributed_31", "trainable": true}}, {"inbound_nodes": [[["time_distributed_31", 0, 0, {}]]], "name": "time_distributed_32", "class_name": "TimeDistributed", "config": {"layer": {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_12", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "momentum": 0.99, "trainable": true, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "center": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, "name": "time_distributed_32", "trainable": true}}, {"inbound_nodes": [[["time_distributed_32", 0, 0, {}]]], "name": "time_distributed_33", "class_name": "TimeDistributed", "config": {"layer": {"class_name": "Activation", "config": {"name": "activation_9", "trainable": true, "activation": "relu6"}}, "name": "time_distributed_33", "trainable": true}}, {"inbound_nodes": [[["time_distributed_33", 0, 0, {}]]], "name": "time_distributed_34", "class_name": "TimeDistributed", "config": {"layer": {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_regularizer": null, "name": "conv2d_9", "activity_regularizer": null, "filters": 32, "padding": "same", "trainable": true, "bias_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "use_bias": true, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last"}}, "name": "time_distributed_34", "trainable": true}}, {"inbound_nodes": [[["time_distributed_34", 0, 0, {}]]], "name": "time_distributed_35", "class_name": "TimeDistributed", "config": {"layer": {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_13", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "momentum": 0.99, "trainable": true, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "center": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, "name": "time_distributed_35", "trainable": true}}, {"inbound_nodes": [[["time_distributed_35", 0, 0, {}]]], "name": "time_distributed_36", "class_name": "TimeDistributed", "config": {"layer": {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_regularizer": null, "name": "conv2d_10", "activity_regularizer": null, "filters": 192, "padding": "same", "trainable": true, "bias_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "use_bias": true, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last"}}, "name": "time_distributed_36", "trainable": true}}, {"inbound_nodes": [[["time_distributed_36", 0, 0, {}]]], "name": "time_distributed_37", "class_name": "TimeDistributed", "config": {"layer": {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_14", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "momentum": 0.99, "trainable": true, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "center": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, "name": "time_distributed_37", "trainable": true}}, {"inbound_nodes": [[["time_distributed_37", 0, 0, {}]]], "name": "time_distributed_38", "class_name": "TimeDistributed", "config": {"layer": {"class_name": "Activation", "config": {"name": "activation_10", "trainable": true, "activation": "relu6"}}, "name": "time_distributed_38", "trainable": true}}, {"inbound_nodes": [[["time_distributed_38", 0, 0, {}]]], "name": "time_distributed_39", "class_name": "TimeDistributed", "config": {"layer": {"class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_5", "activity_regularizer": null, "dilation_rate": [1, 1], "padding": "same", "trainable": true, "bias_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "data_format": "channels_last", "depthwise_constraint": null, "use_bias": true, "depth_multiplier": 1, "bias_constraint": null, "strides": [1, 1], "depthwise_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}}, "name": "time_distributed_39", "trainable": true}}, {"inbound_nodes": [[["time_distributed_39", 0, 0, {}]]], "name": "time_distributed_40", "class_name": "TimeDistributed", "config": {"layer": {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_15", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "momentum": 0.99, "trainable": true, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "center": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, "name": "time_distributed_40", "trainable": true}}, {"inbound_nodes": [[["time_distributed_40", 0, 0, {}]]], "name": "time_distributed_41", "class_name": "TimeDistributed", "config": {"layer": {"class_name": "Activation", "config": {"name": "activation_11", "trainable": true, "activation": "relu6"}}, "name": "time_distributed_41", "trainable": true}}, {"inbound_nodes": [[["time_distributed_41", 0, 0, {}]]], "name": "time_distributed_42", "class_name": "TimeDistributed", "config": {"layer": {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_regularizer": null, "name": "conv2d_11", "activity_regularizer": null, "filters": 32, "padding": "same", "trainable": true, "bias_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "use_bias": true, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last"}}, "name": "time_distributed_42", "trainable": true}}, {"inbound_nodes": [[["time_distributed_42", 0, 0, {}]]], "name": "time_distributed_43", "class_name": "TimeDistributed", "config": {"layer": {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_16", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "momentum": 0.99, "trainable": true, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "center": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, "name": "time_distributed_43", "trainable": true}}, {"inbound_nodes": [[["time_distributed_43", 0, 0, {}], ["time_distributed_35", 0, 0, {}]]], "name": "add_2", "class_name": "Add", "config": {"name": "add_2", "trainable": true}}, {"inbound_nodes": [[["add_2", 0, 0, {}]]], "name": "time_distributed_44", "class_name": "TimeDistributed", "config": {"layer": {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_regularizer": null, "name": "conv2d_12", "activity_regularizer": null, "filters": 192, "padding": "same", "trainable": true, "bias_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "use_bias": true, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last"}}, "name": "time_distributed_44", "trainable": true}}, {"inbound_nodes": [[["time_distributed_44", 0, 0, {}]]], "name": "time_distributed_45", "class_name": "TimeDistributed", "config": {"layer": {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_17", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "momentum": 0.99, "trainable": true, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "center": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, "name": "time_distributed_45", "trainable": true}}, {"inbound_nodes": [[["time_distributed_45", 0, 0, {}]]], "name": "time_distributed_46", "class_name": "TimeDistributed", "config": {"layer": {"class_name": "Activation", "config": {"name": "activation_12", "trainable": true, "activation": "relu6"}}, "name": "time_distributed_46", "trainable": true}}, {"inbound_nodes": [[["time_distributed_46", 0, 0, {}]]], "name": "time_distributed_47", "class_name": "TimeDistributed", "config": {"layer": {"class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_6", "activity_regularizer": null, "dilation_rate": [1, 1], "padding": "same", "trainable": true, "bias_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "data_format": "channels_last", "depthwise_constraint": null, "use_bias": true, "depth_multiplier": 1, "bias_constraint": null, "strides": [1, 1], "depthwise_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}}, "name": "time_distributed_47", "trainable": true}}, {"inbound_nodes": [[["time_distributed_47", 0, 0, {}]]], "name": "time_distributed_48", "class_name": "TimeDistributed", "config": {"layer": {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_18", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "momentum": 0.99, "trainable": true, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "center": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, "name": "time_distributed_48", "trainable": true}}, {"inbound_nodes": [[["time_distributed_48", 0, 0, {}]]], "name": "time_distributed_49", "class_name": "TimeDistributed", "config": {"layer": {"class_name": "Activation", "config": {"name": "activation_13", "trainable": true, "activation": "relu6"}}, "name": "time_distributed_49", "trainable": true}}, {"inbound_nodes": [[["time_distributed_49", 0, 0, {}]]], "name": "time_distributed_50", "class_name": "TimeDistributed", "config": {"layer": {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_regularizer": null, "name": "conv2d_13", "activity_regularizer": null, "filters": 32, "padding": "same", "trainable": true, "bias_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "use_bias": true, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last"}}, "name": "time_distributed_50", "trainable": true}}, {"inbound_nodes": [[["time_distributed_50", 0, 0, {}]]], "name": "time_distributed_51", "class_name": "TimeDistributed", "config": {"layer": {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_19", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "momentum": 0.99, "trainable": true, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "center": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, "name": "time_distributed_51", "trainable": true}}, {"inbound_nodes": [[["time_distributed_51", 0, 0, {}], ["add_2", 0, 0, {}]]], "name": "add_3", "class_name": "Add", "config": {"name": "add_3", "trainable": true}}, {"inbound_nodes": [[["add_3", 0, 0, {}]]], "name": "time_distributed_52", "class_name": "TimeDistributed", "config": {"layer": {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_regularizer": null, "name": "conv2d_14", "activity_regularizer": null, "filters": 192, "padding": "same", "trainable": true, "bias_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "use_bias": true, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last"}}, "name": "time_distributed_52", "trainable": true}}, {"inbound_nodes": [[["time_distributed_52", 0, 0, {}]]], "name": "time_distributed_53", "class_name": "TimeDistributed", "config": {"layer": {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_20", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "momentum": 0.99, "trainable": true, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "center": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, "name": "time_distributed_53", "trainable": true}}, {"inbound_nodes": [[["time_distributed_53", 0, 0, {}]]], "name": "time_distributed_54", "class_name": "TimeDistributed", "config": {"layer": {"class_name": "Activation", "config": {"name": "activation_14", "trainable": true, "activation": "relu6"}}, "name": "time_distributed_54", "trainable": true}}, {"inbound_nodes": [[["time_distributed_54", 0, 0, {}]]], "name": "time_distributed_55", "class_name": "TimeDistributed", "config": {"layer": {"class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_7", "activity_regularizer": null, "dilation_rate": [1, 1], "padding": "same", "trainable": true, "bias_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "data_format": "channels_last", "depthwise_constraint": null, "use_bias": true, "depth_multiplier": 1, "bias_constraint": null, "strides": [2, 2], "depthwise_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}}, "name": "time_distributed_55", "trainable": true}}, {"inbound_nodes": [[["time_distributed_55", 0, 0, {}]]], "name": "time_distributed_56", "class_name": "TimeDistributed", "config": {"layer": {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_21", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "momentum": 0.99, "trainable": true, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "center": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, "name": "time_distributed_56", "trainable": true}}, {"inbound_nodes": [[["time_distributed_56", 0, 0, {}]]], "name": "time_distributed_57", "class_name": "TimeDistributed", "config": {"layer": {"class_name": "Activation", "config": {"name": "activation_15", "trainable": true, "activation": "relu6"}}, "name": "time_distributed_57", "trainable": true}}, {"inbound_nodes": [[["time_distributed_57", 0, 0, {}]]], "name": "time_distributed_58", "class_name": "TimeDistributed", "config": {"layer": {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_regularizer": null, "name": "conv2d_15", "activity_regularizer": null, "filters": 64, "padding": "same", "trainable": true, "bias_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "use_bias": true, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last"}}, "name": "time_distributed_58", "trainable": true}}, {"inbound_nodes": [[["time_distributed_58", 0, 0, {}]]], "name": "time_distributed_59", "class_name": "TimeDistributed", "config": {"layer": {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_22", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "momentum": 0.99, "trainable": true, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "center": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, "name": "time_distributed_59", "trainable": true}}, {"inbound_nodes": [[["time_distributed_59", 0, 0, {}]]], "name": "time_distributed_60", "class_name": "TimeDistributed", "config": {"layer": {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_regularizer": null, "name": "conv2d_16", "activity_regularizer": null, "filters": 384, "padding": "same", "trainable": true, "bias_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "use_bias": true, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last"}}, "name": "time_distributed_60", "trainable": true}}, {"inbound_nodes": [[["time_distributed_60", 0, 0, {}]]], "name": "time_distributed_61", "class_name": "TimeDistributed", "config": {"layer": {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_23", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "momentum": 0.99, "trainable": true, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "center": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, "name": "time_distributed_61", "trainable": true}}, {"inbound_nodes": [[["time_distributed_61", 0, 0, {}]]], "name": "time_distributed_62", "class_name": "TimeDistributed", "config": {"layer": {"class_name": "Activation", "config": {"name": "activation_16", "trainable": true, "activation": "relu6"}}, "name": "time_distributed_62", "trainable": true}}, {"inbound_nodes": [[["time_distributed_62", 0, 0, {}]]], "name": "time_distributed_63", "class_name": "TimeDistributed", "config": {"layer": {"class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_8", "activity_regularizer": null, "dilation_rate": [1, 1], "padding": "same", "trainable": true, "bias_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "data_format": "channels_last", "depthwise_constraint": null, "use_bias": true, "depth_multiplier": 1, "bias_constraint": null, "strides": [1, 1], "depthwise_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}}, "name": "time_distributed_63", "trainable": true}}, {"inbound_nodes": [[["time_distributed_63", 0, 0, {}]]], "name": "time_distributed_64", "class_name": "TimeDistributed", "config": {"layer": {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_24", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "momentum": 0.99, "trainable": true, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "center": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, "name": "time_distributed_64", "trainable": true}}, {"inbound_nodes": [[["time_distributed_64", 0, 0, {}]]], "name": "time_distributed_65", "class_name": "TimeDistributed", "config": {"layer": {"class_name": "Activation", "config": {"name": "activation_17", "trainable": true, "activation": "relu6"}}, "name": "time_distributed_65", "trainable": true}}, {"inbound_nodes": [[["time_distributed_65", 0, 0, {}]]], "name": "time_distributed_66", "class_name": "TimeDistributed", "config": {"layer": {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_regularizer": null, "name": "conv2d_17", "activity_regularizer": null, "filters": 64, "padding": "same", "trainable": true, "bias_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "use_bias": true, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last"}}, "name": "time_distributed_66", "trainable": true}}, {"inbound_nodes": [[["time_distributed_66", 0, 0, {}]]], "name": "time_distributed_67", "class_name": "TimeDistributed", "config": {"layer": {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_25", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "momentum": 0.99, "trainable": true, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "center": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, "name": "time_distributed_67", "trainable": true}}, {"inbound_nodes": [[["time_distributed_67", 0, 0, {}], ["time_distributed_59", 0, 0, {}]]], "name": "add_4", "class_name": "Add", "config": {"name": "add_4", "trainable": true}}, {"inbound_nodes": [[["add_4", 0, 0, {}]]], "name": "time_distributed_68", "class_name": "TimeDistributed", "config": {"layer": {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_regularizer": null, "name": "conv2d_18", "activity_regularizer": null, "filters": 384, "padding": "same", "trainable": true, "bias_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "use_bias": true, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last"}}, "name": "time_distributed_68", "trainable": true}}, {"inbound_nodes": [[["time_distributed_68", 0, 0, {}]]], "name": "time_distributed_69", "class_name": "TimeDistributed", "config": {"layer": {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_26", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "momentum": 0.99, "trainable": true, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "center": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, "name": "time_distributed_69", "trainable": true}}, {"inbound_nodes": [[["time_distributed_69", 0, 0, {}]]], "name": "time_distributed_70", "class_name": "TimeDistributed", "config": {"layer": {"class_name": "Activation", "config": {"name": "activation_18", "trainable": true, "activation": "relu6"}}, "name": "time_distributed_70", "trainable": true}}, {"inbound_nodes": [[["time_distributed_70", 0, 0, {}]]], "name": "time_distributed_71", "class_name": "TimeDistributed", "config": {"layer": {"class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_9", "activity_regularizer": null, "dilation_rate": [1, 1], "padding": "same", "trainable": true, "bias_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "data_format": "channels_last", "depthwise_constraint": null, "use_bias": true, "depth_multiplier": 1, "bias_constraint": null, "strides": [1, 1], "depthwise_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}}, "name": "time_distributed_71", "trainable": true}}, {"inbound_nodes": [[["time_distributed_71", 0, 0, {}]]], "name": "time_distributed_72", "class_name": "TimeDistributed", "config": {"layer": {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_27", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": -1, "momentum": 0.99, "trainable": true, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "center": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, "name": "time_distributed_72", "trainable": true}}, {"inbound_nodes": [[["time_distributed_72", 0, 0, {}]]], "name": "time_distributed_73", "class_name": "TimeDistributed", "config": {"layer": {"class_name": "Activation", "config": {"name": "activation_19", "trainable": true, "activation": "relu6"}}, "name": "time_distributed_73", "trainable": true}}, {"inbound_nodes": [[["time_distributed_73", 0, 0, {}]]], "name": "time_distributed_74", "class_name": "TimeDistributed", "config": {"layer": {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_regularizer": null, "name": "conv2d_19", "activity_regularizer": null, "filters": 64, "padding": "same", "trainable": true, "bias_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "use_bias": true, "dilation_rate": [1, 1], "strides": [1, 1], "data_format": "channels_last"}}, "name": "time_distributed_74", "trainable": true}}, {"inbound_nodes": [[["time_distributed_74", 0, 0, {}]]], "name": "time_distributed_75", "class_name": "TimeDistributed", "config": {"layer": {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_28", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, 