{"class_name": "Model", "keras_version": "2.2.2", "backend": "tensorflow", "config": {"output_layers": [["reshape_3", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"sparse": false, "batch_input_shape": [null, 720, 1280, 3], "name": "input_1", "dtype": "float32"}, "inbound_nodes": []}, {"class_name": "Lambda", "name": "lambda_1", "config": {"function": ["4wEAAAAAAAAAAQAAAAsAAAATAAAAc0kAAAB0AABqAQB8AABkAQBkAgCIAACIAABkAgBnBABkAwBk\nAgCIAQCIAQBkAgBnBABkBABkAgBkAgBkAgBkAgBnBABkBQBkBgCDAQRTKQdO2gZrc2l6ZXPpAQAA\nANoHc3RyaWRlc9oFcmF0ZXPaB3BhZGRpbmfaBVZBTElEKQLaAnRm2hVleHRyYWN0X2ltYWdlX3Bh\ndGNoZXMpAdoBeCkC2gZrZXJuZWzaBnN0cmlkZakA+iQvaG9tZS95b29uZ2kvV2Fsay1Bc3Npc3Rh\nbnQvbW9kZWwucHnaCDxsYW1iZGE+YgAAAHMCAAAABgE=\n", null, [80, 80]], "function_type": "lambda", "trainable": true, "output_shape_type": "raw", "output_shape": null, "name": "lambda_1", "arguments": {}}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Reshape", "name": "reshape_1", "config": {"target_shape": [9, 16, 80, 80, 3], "trainable": true, "name": "reshape_1"}, "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Reshape", "name": "reshape_2", "config": {"target_shape": [144, 80, 80, 3], "trainable": true, "name": "reshape_2"}, "inbound_nodes": [[["reshape_1", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "name": "time_distributed_1", "config": {"trainable": true, "layer": {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "padding": "same", "filters": 32, "strides": [2, 2], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "conv2d_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "activation": "linear", "kernel_size": [3, 3], "kernel_constraint": null, "bias_constraint": null}}, "name": "time_distributed_1"}, "inbound_nodes": [[["reshape_2", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "name": "time_distributed_2", "config": {"trainable": true, "layer": {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "center": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_1", "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "momentum": 0.99}}, "name": "time_distributed_2"}, "inbound_nodes": [[["time_distributed_1", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "name": "time_distributed_3", "config": {"trainable": true, "layer": {"class_name": "Activation", "config": {"trainable": true, "activation": "relu6", "name": "activation_1"}}, "name": "time_distributed_3"}, "inbound_nodes": [[["time_distributed_2", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "name": "time_distributed_4", "config": {"trainable": true, "layer": {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "padding": "same", "filters": 32, "strides": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "conv2d_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "activation": "linear", "kernel_size": [1, 1], "kernel_constraint": null, "bias_constraint": null}}, "name": "time_distributed_4"}, "inbound_nodes": [[["time_distributed_3", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "name": "time_distributed_5", "config": {"trainable": true, "layer": {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "center": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_2", "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "momentum": 0.99}}, "name": "time_distributed_5"}, "inbound_nodes": [[["time_distributed_4", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "name": "time_distributed_6", "config": {"trainable": true, "layer": {"class_name": "Activation", "config": {"trainable": true, "activation": "relu6", "name": "activation_2"}}, "name": "time_distributed_6"}, "inbound_nodes": [[["time_distributed_5", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "name": "time_distributed_7", "config": {"trainable": true, "layer": {"class_name": "DepthwiseConv2D", "config": {"bias_regularizer": null, "depthwise_regularizer": null, "trainable": true, "bias_constraint": null, "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "data_format": "channels_last", "strides": [1, 1], "depthwise_constraint": null, "name": "depthwise_conv2d_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "depth_multiplier": 1, "activation": "linear", "kernel_size": [3, 3]}}, "name": "time_distributed_7"}, "inbound_nodes": [[["time_distributed_6", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "name": "time_distributed_8", "config": {"trainable": true, "layer": {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "center": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_3", "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "momentum": 0.99}}, "name": "time_distributed_8"}, "inbound_nodes": [[["time_distributed_7", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "name": "time_distributed_9", "config": {"trainable": true, "layer": {"class_name": "Activation", "config": {"trainable": true, "activation": "relu6", "name": "activation_3"}}, "name": "time_distributed_9"}, "inbound_nodes": [[["time_distributed_8", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "name": "time_distributed_10", "config": {"trainable": true, "layer": {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "padding": "same", "filters": 16, "strides": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "conv2d_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "activation": "linear", "kernel_size": [1, 1], "kernel_constraint": null, "bias_constraint": null}}, "name": "time_distributed_10"}, "inbound_nodes": [[["time_distributed_9", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "name": "time_distributed_11", "config": {"trainable": true, "layer": {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "center": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_4", "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "momentum": 0.99}}, "name": "time_distributed_11"}, "inbound_nodes": [[["time_distributed_10", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "name": "time_distributed_12", "config": {"trainable": true, "layer": {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "padding": "same", "filters": 96, "strides": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "conv2d_4", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "activation": "linear", "kernel_size": [1, 1], "kernel_constraint": null, "bias_constraint": null}}, "name": "time_distributed_12"}, "inbound_nodes": [[["time_distributed_11", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "name": "time_distributed_13", "config": {"trainable": true, "layer": {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "center": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_5", "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "momentum": 0.99}}, "name": "time_distributed_13"}, "inbound_nodes": [[["time_distributed_12", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "name": "time_distributed_14", "config": {"trainable": true, "layer": {"class_name": "Activation", "config": {"trainable": true, "activation": "relu6", "name": "activation_4"}}, "name": "time_distributed_14"}, "inbound_nodes": [[["time_distributed_13", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "name": "time_distributed_15", "config": {"trainable": true, "layer": {"class_name": "DepthwiseConv2D", "config": {"bias_regularizer": null, "depthwise_regularizer": null, "trainable": true, "bias_constraint": null, "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "data_format": "channels_last", "strides": [2, 2], "depthwise_constraint": null, "name": "depthwise_conv2d_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "depth_multiplier": 1, "activation": "linear", "kernel_size": [3, 3]}}, "name": "time_distributed_15"}, "inbound_nodes": [[["time_distributed_14", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "name": "time_distributed_16", "config": {"trainable": true, "layer": {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "center": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_6", "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "momentum": 0.99}}, "name": "time_distributed_16"}, "inbound_nodes": [[["time_distributed_15", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "name": "time_distributed_17", "config": {"trainable": true, "layer": {"class_name": "Activation", "config": {"trainable": true, "activation": "relu6", "name": "activation_5"}}, "name": "time_distributed_17"}, "inbound_nodes": [[["time_distributed_16", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "name": "time_distributed_18", "config": {"trainable": true, "layer": {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "padding": "same", "filters": 24, "strides": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "conv2d_5", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "activation": "linear", "kernel_size": [1, 1], "kernel_constraint": null, "bias_constraint": null}}, "name": "time_distributed_18"}, "inbound_nodes": [[["time_distributed_17", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "name": "time_distributed_19", "config": {"trainable": true, "layer": {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "center": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_7", "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "momentum": 0.99}}, "name": "time_distributed_19"}, "inbound_nodes": [[["time_distributed_18", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "name": "time_distributed_20", "config": {"trainable": true, "layer": {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "padding": "same", "filters": 144, "strides": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "conv2d_6", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "activation": "linear", "kernel_size": [1, 1], "kernel_constraint": null, "bias_constraint": null}}, "name": "time_distributed_20"}, "inbound_nodes": [[["time_distributed_19", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "name": "time_distributed_21", "config": {"trainable": true, "layer": {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "center": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_8", "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "momentum": 0.99}}, "name": "time_distributed_21"}, "inbound_nodes": [[["time_distributed_20", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "name": "time_distributed_22", "config": {"trainable": true, "layer": {"class_name": "Activation", "config": {"trainable": true, "activation": "relu6", "name": "activation_6"}}, "name": "time_distributed_22"}, "inbound_nodes": [[["time_distributed_21", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "name": "time_distributed_23", "config": {"trainable": true, "layer": {"class_name": "DepthwiseConv2D", "config": {"bias_regularizer": null, "depthwise_regularizer": null, "trainable": true, "bias_constraint": null, "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "data_format": "channels_last", "strides": [1, 1], "depthwise_constraint": null, "name": "depthwise_conv2d_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "depth_multiplier": 1, "activation": "linear", "kernel_size": [3, 3]}}, "name": "time_distributed_23"}, "inbound_nodes": [[["time_distributed_22", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "name": "time_distributed_24", "config": {"trainable": true, "layer": {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "center": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_9", "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "momentum": 0.99}}, "name": "time_distributed_24"}, "inbound_nodes": [[["time_distributed_23", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "name": "time_distributed_25", "config": {"trainable": true, "layer": {"class_name": "Activation", "config": {"trainable": true, "activation": "relu6", "name": "activation_7"}}, "name": "time_distributed_25"}, "inbound_nodes": [[["time_distributed_24", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "name": "time_distributed_26", "config": {"trainable": true, "layer": {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "padding": "same", "filters": 24, "strides": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "conv2d_7", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "activation": "linear", "kernel_size": [1, 1], "kernel_constraint": null, "bias_constraint": null}}, "name": "time_distributed_26"}, "inbound_nodes": [[["time_distributed_25", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "name": "time_distributed_27", "config": {"trainable": true, "layer": {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "center": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_10", "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "momentum": 0.99}}, "name": "time_distributed_27"}, "inbound_nodes": [[["time_distributed_26", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_1", "config": {"trainable": true, "name": "add_1"}, "inbound_nodes": [[["time_distributed_27", 0, 0, {}], ["time_distributed_19", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "name": "time_distributed_28", "config": {"trainable": true, "layer": {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "padding": "same", "filters": 144, "strides": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "conv2d_8", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "activation": "linear", "kernel_size": [1, 1], "kernel_constraint": null, "bias_constraint": null}}, "name": "time_distributed_28"}, "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "name": "time_distributed_29", "config": {"trainable": true, "layer": {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "center": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_11", "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "momentum": 0.99}}, "name": "time_distributed_29"}, "inbound_nodes": [[["time_distributed_28", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "name": "time_distributed_30", "config": {"trainable": true, "layer": {"class_name": "Activation", "config": {"trainable": true, "activation": "relu6", "name": "activation_8"}}, "name": "time_distributed_30"}, "inbound_nodes": [[["time_distributed_29", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "name": "time_distributed_31", "config": {"trainable": true, "layer": {"class_name": "DepthwiseConv2D", "config": {"bias_regularizer": null, "depthwise_regularizer": null, "trainable": true, "bias_constraint": null, "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "data_format": "channels_last", "strides": [2, 2], "depthwise_constraint": null, "name": "depthwise_conv2d_4", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "depth_multiplier": 1, "activation": "linear", "kernel_size": [3, 3]}}, "name": "time_distributed_31"}, "inbound_nodes": [[["time_distributed_30", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "name": "time_distributed_32", "config": {"trainable": true, "layer": {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "center": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_12", "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "momentum": 0.99}}, "name": "time_distributed_32"}, "inbound_nodes": [[["time_distributed_31", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "name": "time_distributed_33", "config": {"trainable": true, "layer": {"class_name": "Activation", "config": {"trainable": true, "activation": "relu6", "name": "activation_9"}}, "name": "time_distributed_33"}, "inbound_nodes": [[["time_distributed_32", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "name": "time_distributed_34", "config": {"trainable": true, "layer": {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "padding": "same", "filters": 32, "strides": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "conv2d_9", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "activation": "linear", "kernel_size": [1, 1], "kernel_constraint": null, "bias_constraint": null}}, "name": "time_distributed_34"}, "inbound_nodes": [[["time_distributed_33", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "name": "time_distributed_35", "config": {"trainable": true, "layer": {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "center": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_13", "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "momentum": 0.99}}, "name": "time_distributed_35"}, "inbound_nodes": [[["time_distributed_34", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "name": "time_distributed_36", "config": {"trainable": true, "layer": {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "padding": "same", "filters": 192, "strides": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "conv2d_10", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "activation": "linear", "kernel_size": [1, 1], "kernel_constraint": null, "bias_constraint": null}}, "name": "time_distributed_36"}, "inbound_nodes": [[["time_distributed_35", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "name": "time_distributed_37", "config": {"trainable": true, "layer": {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "center": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_14", "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "momentum": 0.99}}, "name": "time_distributed_37"}, "inbound_nodes": [[["time_distributed_36", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "name": "time_distributed_38", "config": {"trainable": true, "layer": {"class_name": "Activation", "config": {"trainable": true, "activation": "relu6", "name": "activation_10"}}, "name": "time_distributed_38"}, "inbound_nodes": [[["time_distributed_37", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "name": "time_distributed_39", "config": {"trainable": true, "layer": {"class_name": "DepthwiseConv2D", "config": {"bias_regularizer": null, "depthwise_regularizer": null, "trainable": true, "bias_constraint": null, "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "data_format": "channels_last", "strides": [1, 1], "depthwise_constraint": null, "name": "depthwise_conv2d_5", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "depth_multiplier": 1, "activation": "linear", "kernel_size": [3, 3]}}, "name": "time_distributed_39"}, "inbound_nodes": [[["time_distributed_38", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "name": "time_distributed_40", "config": {"trainable": true, "layer": {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "center": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_15", "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "momentum": 0.99}}, "name": "time_distributed_40"}, "inbound_nodes": [[["time_distributed_39", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "name": "time_distributed_41", "config": {"trainable": true, "layer": {"class_name": "Activation", "config": {"trainable": true, "activation": "relu6", "name": "activation_11"}}, "name": "time_distributed_41"}, "inbound_nodes": [[["time_distributed_40", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "name": "time_distributed_42", "config": {"trainable": true, "layer": {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "padding": "same", "filters": 32, "strides": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "conv2d_11", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "activation": "linear", "kernel_size": [1, 1], "kernel_constraint": null, "bias_constraint": null}}, "name": "time_distributed_42"}, "inbound_nodes": [[["time_distributed_41", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "name": "time_distributed_43", "config": {"trainable": true, "layer": {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "center": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_16", "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "momentum": 0.99}}, "name": "time_distributed_43"}, "inbound_nodes": [[["time_distributed_42", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_2", "config": {"trainable": true, "name": "add_2"}, "inbound_nodes": [[["time_distributed_43", 0, 0, {}], ["time_distributed_35", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "name": "time_distributed_44", "config": {"trainable": true, "layer": {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "padding": "same", "filters": 192, "strides": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "conv2d_12", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "activation": "linear", "kernel_size": [1, 1], "kernel_constraint": null, "bias_constraint": null}}, "name": "time_distributed_44"}, "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "name": "time_distributed_45", "config": {"trainable": true, "layer": {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "center": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_17", "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "momentum": 0.99}}, "name": "time_distributed_45"}, "inbound_nodes": [[["time_distributed_44", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "name": "time_distributed_46", "config": {"trainable": true, "layer": {"class_name": "Activation", "config": {"trainable": true, "activation": "relu6", "name": "activation_12"}}, "name": "time_distributed_46"}, "inbound_nodes": [[["time_distributed_45", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "name": "time_distributed_47", "config": {"trainable": true, "layer": {"class_name": "DepthwiseConv2D", "config": {"bias_regularizer": null, "depthwise_regularizer": null, "trainable": true, "bias_constraint": null, "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "data_format": "channels_last", "strides": [1, 1], "depthwise_constraint": null, "name": "depthwise_conv2d_6", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "depth_multiplier": 1, "activation": "linear", "kernel_size": [3, 3]}}, "name": "time_distributed_47"}, "inbound_nodes": [[["time_distributed_46", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "name": "time_distributed_48", "config": {"trainable": true, "layer": {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "center": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_18", "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "momentum": 0.99}}, "name": "time_distributed_48"}, "inbound_nodes": [[["time_distributed_47", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "name": "time_distributed_49", "config": {"trainable": true, "layer": {"class_name": "Activation", "config": {"trainable": true, "activation": "relu6", "name": "activation_13"}}, "name": "time_distributed_49"}, "inbound_nodes": [[["time_distributed_48", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "name": "time_distributed_50", "config": {"trainable": true, "layer": {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "padding": "same", "filters": 32, "strides": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "conv2d_13", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "activation": "linear", "kernel_size": [1, 1], "kernel_constraint": null, "bias_constraint": null}}, "name": "time_distributed_50"}, "inbound_nodes": [[["time_distributed_49", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "name": "time_distributed_51", "config": {"trainable": true, "layer": {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "center": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_19", "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "momentum": 0.99}}, "name": "time_distributed_51"}, "inbound_nodes": [[["time_distributed_50", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_3", "config": {"trainable": true, "name": "add_3"}, "inbound_nodes": [[["time_distributed_51", 0, 0, {}], ["add_2", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "name": "time_distributed_52", "config": {"trainable": true, "layer": {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "padding": "same", "filters": 192, "strides": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "conv2d_14", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "activation": "linear", "kernel_size": [1, 1], "kernel_constraint": null, "bias_constraint": null}}, "name": "time_distributed_52"}, "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "name": "time_distributed_53", "config": {"trainable": true, "layer": {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "center": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_20", "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "momentum": 0.99}}, "name": "time_distributed_53"}, "inbound_nodes": [[["time_distributed_52", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "name": "time_distributed_54", "config": {"trainable": true, "layer": {"class_name": "Activation", "config": {"trainable": true, "activation": "relu6", "name": "activation_14"}}, "name": "time_distributed_54"}, "inbound_nodes": [[["time_distributed_53", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "name": "time_distributed_55", "config": {"trainable": true, "layer": {"class_name": "DepthwiseConv2D", "config": {"bias_regularizer": null, "depthwise_regularizer": null, "trainable": true, "bias_constraint": null, "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "data_format": "channels_last", "strides": [2, 2], "depthwise_constraint": null, "name": "depthwise_conv2d_7", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "depth_multiplier": 1, "activation": "linear", "kernel_size": [3, 3]}}, "name": "time_distributed_55"}, "inbound_nodes": [[["time_distributed_54", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "name": "time_distributed_56", "config": {"trainable": true, "layer": {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "center": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_21", "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "momentum": 0.99}}, "name": "time_distributed_56"}, "inbound_nodes": [[["time_distributed_55", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "name": "time_distributed_57", "config": {"trainable": true, "layer": {"class_name": "Activation", "config": {"trainable": true, "activation": "relu6", "name": "activation_15"}}, "name": "time_distributed_57"}, "inbound_nodes": [[["time_distributed_56", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "name": "time_distributed_58", "config": {"trainable": true, "layer": {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "padding": "same", "filters": 64, "strides": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "conv2d_15", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "activation": "linear", "kernel_size": [1, 1], "kernel_constraint": null, "bias_constraint": null}}, "name": "time_distributed_58"}, "inbound_nodes": [[["time_distributed_57", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "name": "time_distributed_59", "config": {"trainable": true, "layer": {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "center": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_22", "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "momentum": 0.99}}, "name": "time_distributed_59"}, "inbound_nodes": [[["time_distributed_58", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "name": "time_distributed_60", "config": {"trainable": true, "layer": {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "padding": "same", "filters": 384, "strides": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "conv2d_16", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "activation": "linear", "kernel_size": [1, 1], "kernel_constraint": null, "bias_constraint": null}}, "name": "time_distributed_60"}, "inbound_nodes": [[["time_distributed_59", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "name": "time_distributed_61", "config": {"trainable": true, "layer": {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "center": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_23", "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "momentum": 0.99}}, "name": "time_distributed_61"}, "inbound_nodes": [[["time_distributed_60", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "name": "time_distributed_62", "config": {"trainable": true, "layer": {"class_name": "Activation", "config": {"trainable": true, "activation": "relu6", "name": "activation_16"}}, "name": "time_distributed_62"}, "inbound_nodes": [[["time_distributed_61", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "name": "time_distributed_63", "config": {"trainable": true, "layer": {"class_name": "DepthwiseConv2D", "config": {"bias_regularizer": null, "depthwise_regularizer": null, "trainable": true, "bias_constraint": null, "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "data_format": "channels_last", "strides": [1, 1], "depthwise_constraint": null, "name": "depthwise_conv2d_8", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "depth_multiplier": 1, "activation": "linear", "kernel_size": [3, 3]}}, "name": "time_distributed_63"}, "inbound_nodes": [[["time_distributed_62", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "name": "time_distributed_64", "config": {"trainable": true, "layer": {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "center": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_24", "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "momentum": 0.99}}, "name": "time_distributed_64"}, "inbound_nodes": [[["time_distributed_63", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "name": "time_distributed_65", "config": {"trainable": true, "layer": {"class_name": "Activation", "config": {"trainable": true, "activation": "relu6", "name": "activation_17"}}, "name": "time_distributed_65"}, "inbound_nodes": [[["time_distributed_64", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "name": "time_distributed_66", "config": {"trainable": true, "layer": {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "padding": "same", "filters": 64, "strides": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "conv2d_17", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "activation": "linear", "kernel_size": [1, 1], "kernel_constraint": null, "bias_constraint": null}}, "name": "time_distributed_66"}, "inbound_nodes": [[["time_distributed_65", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "name": "time_distributed_67", "config": {"trainable": true, "layer": {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "center": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_25", "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "momentum": 0.99}}, "name": "time_distributed_67"}, "inbound_nodes": [[["time_distributed_66", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_4", "config": {"trainable": true, "name": "add_4"}, "inbound_nodes": [[["time_distributed_67", 0, 0, {}], ["time_distributed_59", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "name": "time_distributed_68", "config": {"trainable": true, "layer": {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "padding": "same", "filters": 384, "strides": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "conv2d_18", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "activation": "linear", "kernel_size": [1, 1], "kernel_constraint": null, "bias_constraint": null}}, "name": "time_distributed_68"}, "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "name": "time_distributed_69", "config": {"trainable": true, "layer": {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "center": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_26", "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "momentum": 0.99}}, "name": "time_distributed_69"}, "inbound_nodes": [[["time_distributed_68", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "name": "time_distributed_70", "config": {"trainable": true, "layer": {"class_name": "Activation", "config": {"trainable": true, "activation": "relu6", "name": "activation_18"}}, "name": "time_distributed_70"}, "inbound_nodes": [[["time_distributed_69", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "name": "time_distributed_71", "config": {"trainable": true, "layer": {"class_name": "DepthwiseConv2D", "config": {"bias_regularizer": null, "depthwise_regularizer": null, "trainable": true, "bias_constraint": null, "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "data_format": "channels_last", "strides": [1, 1], "depthwise_constraint": null, "name": "depthwise_conv2d_9", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "depth_multiplier": 1, "activation": "linear", "kernel_size": [3, 3]}}, "name": "time_distributed_71"}, "inbound_nodes": [[["time_distributed_70", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "name": "time_distributed_72", "config": {"trainable": true, "layer": {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "center": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_27", "scale": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "momentum": 0.99}}, "name": "time_distributed_72"}, "inbound_nodes": [[["time_distributed_71", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "name": "time_distributed_73", "config": {"trainable": true, "layer": {"class_name": "Activation", "config": {"trainable": true, "activation": "relu6", "name": "activation_19"}}, "name": "time_distributed_73"}, "inbound_nodes": [[["time_distributed_72", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "name": "time_distributed_74", "config": {"trainable": true, "layer": {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "padding": "same", "filters": 64, "strides": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "conv2d_19", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "activation": "linear", "kernel_size": [1, 1], "kernel_constraint": null, "bias_constraint": null}}, "name": "time_distributed_74"}, "inbound_nodes": [[["time_distributed_73", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "name": "time_distributed_75", "config": {"trainable": true, "layer": {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "trainable": true, "center": true, "axis": -1, 