{"class_name": "Model", "backend": "tensorflow", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 720, 1280, 3], "name": "input_1", "sparse": false, "dtype": "float32"}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "Lambda", "config": {"function_type": "lambda", "arguments": {}, "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAsAAABDAAAAc0kAAAB0AABqAQB8AABkAQBkAgBkAwBkAwBkAgBnBABkBABk\nAgBkBQBkBQBkAgBnBABkBgBkAgBkAgBkAgBkAgBnBABkBwBkCACDAQRTKQlO2gZrc2l6ZXPpAQAA\nAOl4AAAA2gdzdHJpZGVz6VAAAADaBXJhdGVz2gdwYWRkaW5n2gVWQUxJRCkC2gJ0ZtoVZXh0cmFj\ndF9pbWFnZV9wYXRjaGVzKQHaAXipAHIMAAAA+gh0cmFpbi5wedoIPGxhbWJkYT6VAAAAcwIAAAAG\nAQ==\n", null, null], "name": "lambda_1", "output_shape_type": "raw", "output_shape": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "lambda_1"}, {"class_name": "Reshape", "config": {"trainable": true, "name": "reshape_1", "target_shape": [8, 15, 120, 120, 3]}, "inbound_nodes": [[["lambda_1", 0, 0, {}]]], "name": "reshape_1"}, {"class_name": "Reshape", "config": {"trainable": true, "name": "reshape_2", "target_shape": [120, 120, 120, 3]}, "inbound_nodes": [[["reshape_1", 0, 0, {}]]], "name": "reshape_2"}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "Conv2D", "config": {"strides": [2, 2], "kernel_regularizer": null, "use_bias": true, "activation": "linear", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "conv2d_1", "data_format": "channels_last", "kernel_size": [3, 3], "bias_regularizer": null, "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_constraint": null, "trainable": true, "padding": "same", "dilation_rate": [1, 1]}}, "name": "time_distributed_1"}, "inbound_nodes": [[["reshape_2", 0, 0, {}]]], "name": "time_distributed_1"}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "BatchNormalization", "config": {"scale": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_1", "epsilon": 0.001, "beta_regularizer": null, "center": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "axis": -1}}, "name": "time_distributed_2"}, "inbound_nodes": [[["time_distributed_1", 0, 0, {}]]], "name": "time_distributed_2"}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu6"}}, "name": "time_distributed_3"}, "inbound_nodes": [[["time_distributed_2", 0, 0, {}]]], "name": "time_distributed_3"}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_regularizer": null, "use_bias": true, "activation": "linear", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "conv2d_2", "data_format": "channels_last", "kernel_size": [1, 1], "bias_regularizer": null, "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_constraint": null, "trainable": true, "padding": "same", "dilation_rate": [1, 1]}}, "name": "time_distributed_4"}, "inbound_nodes": [[["time_distributed_3", 0, 0, {}]]], "name": "time_distributed_4"}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "BatchNormalization", "config": {"scale": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_2", "epsilon": 0.001, "beta_regularizer": null, "center": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "axis": -1}}, "name": "time_distributed_5"}, "inbound_nodes": [[["time_distributed_4", 0, 0, {}]]], "name": "time_distributed_5"}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu6"}}, "name": "time_distributed_6"}, "inbound_nodes": [[["time_distributed_5", 0, 0, {}]]], "name": "time_distributed_6"}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "DepthwiseConv2D", "config": {"strides": [1, 1], "activity_regularizer": null, "use_bias": true, "trainable": true, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "name": "depthwise_conv2d_1", "data_format": "channels_last", "kernel_size": [3, 3], "depthwise_constraint": null, "bias_regularizer": null, "depthwise_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "padding": "same"}}, "name": "time_distributed_7"}, "inbound_nodes": [[["time_distributed_6", 0, 0, {}]]], "name": "time_distributed_7"}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "BatchNormalization", "config": {"scale": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_3", "epsilon": 0.001, "beta_regularizer": null, "center": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "axis": -1}}, "name": "time_distributed_8"}, "inbound_nodes": [[["time_distributed_7", 0, 0, {}]]], "name": "time_distributed_8"}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu6"}}, "name": "time_distributed_9"}, "inbound_nodes": [[["time_distributed_8", 0, 0, {}]]], "name": "time_distributed_9"}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_regularizer": null, "use_bias": true, "activation": "linear", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "conv2d_3", "data_format": "channels_last", "kernel_size": [1, 1], "bias_regularizer": null, "filters": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_constraint": null, "trainable": true, "padding": "same", "dilation_rate": [1, 1]}}, "name": "time_distributed_10"}, "inbound_nodes": [[["time_distributed_9", 0, 0, {}]]], "name": "time_distributed_10"}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "BatchNormalization", "config": {"scale": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_4", "epsilon": 0.001, "beta_regularizer": null, "center": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "axis": -1}}, "name": "time_distributed_11"}, "inbound_nodes": [[["time_distributed_10", 0, 0, {}]]], "name": "time_distributed_11"}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_regularizer": null, "use_bias": true, "activation": "linear", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "conv2d_4", "data_format": "channels_last", "kernel_size": [1, 1], "bias_regularizer": null, "filters": 96, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_constraint": null, "trainable": true, "padding": "same", "dilation_rate": [1, 1]}}, "name": "time_distributed_12"}, "inbound_nodes": [[["time_distributed_11", 0, 0, {}]]], "name": "time_distributed_12"}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "BatchNormalization", "config": {"scale": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_5", "epsilon": 0.001, "beta_regularizer": null, "center": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "axis": -1}}, "name": "time_distributed_13"}, "inbound_nodes": [[["time_distributed_12", 0, 0, {}]]], "name": "time_distributed_13"}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu6"}}, "name": "time_distributed_14"}, "inbound_nodes": [[["time_distributed_13", 0, 0, {}]]], "name": "time_distributed_14"}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "DepthwiseConv2D", "config": {"strides": [2, 2], "activity_regularizer": null, "use_bias": true, "trainable": true, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "name": "depthwise_conv2d_2", "data_format": "channels_last", "kernel_size": [3, 3], "depthwise_constraint": null, "bias_regularizer": null, "depthwise_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "padding": "same"}}, "name": "time_distributed_15"}, "inbound_nodes": [[["time_distributed_14", 0, 0, {}]]], "name": "time_distributed_15"}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "BatchNormalization", "config": {"scale": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_6", "epsilon": 0.001, "beta_regularizer": null, "center": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "axis": -1}}, "name": "time_distributed_16"}, "inbound_nodes": [[["time_distributed_15", 0, 0, {}]]], "name": "time_distributed_16"}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "relu6"}}, "name": "time_distributed_17"}, "inbound_nodes": [[["time_distributed_16", 0, 0, {}]]], "name": "time_distributed_17"}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_regularizer": null, "use_bias": true, "activation": "linear", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "conv2d_5", "data_format": "channels_last", "kernel_size": [1, 1], "bias_regularizer": null, "filters": 24, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_constraint": null, "trainable": true, "padding": "same", "dilation_rate": [1, 1]}}, "name": "time_distributed_18"}, "inbound_nodes": [[["time_distributed_17", 0, 0, {}]]], "name": "time_distributed_18"}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "BatchNormalization", "config": {"scale": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_7", "epsilon": 0.001, "beta_regularizer": null, "center": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "axis": -1}}, "name": "time_distributed_19"}, "inbound_nodes": [[["time_distributed_18", 0, 0, {}]]], "name": "time_distributed_19"}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_regularizer": null, "use_bias": true, "activation": "linear", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "conv2d_6", "data_format": "channels_last", "kernel_size": [1, 1], "bias_regularizer": null, "filters": 144, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_constraint": null, "trainable": true, "padding": "same", "dilation_rate": [1, 1]}}, "name": "time_distributed_20"}, "inbound_nodes": [[["time_distributed_19", 0, 0, {}]]], "name": "time_distributed_20"}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "BatchNormalization", "config": {"scale": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_8", "epsilon": 0.001, "beta_regularizer": null, "center": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "axis": -1}}, "name": "time_distributed_21"}, "inbound_nodes": [[["time_distributed_20", 0, 0, {}]]], "name": "time_distributed_21"}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "Activation", "config": {"trainable": true, "name": "activation_6", "activation": "relu6"}}, "name": "time_distributed_22"}, "inbound_nodes": [[["time_distributed_21", 0, 0, {}]]], "name": "time_distributed_22"}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "DepthwiseConv2D", "config": {"strides": [1, 1], "activity_regularizer": null, "use_bias": true, "trainable": true, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "name": "depthwise_conv2d_3", "data_format": "channels_last", "kernel_size": [3, 3], "depthwise_constraint": null, "bias_regularizer": null, "depthwise_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "padding": "same"}}, "name": "time_distributed_23"}, "inbound_nodes": [[["time_distributed_22", 0, 0, {}]]], "name": "time_distributed_23"}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "BatchNormalization", "config": {"scale": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_9", "epsilon": 0.001, "beta_regularizer": null, "center": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "axis": -1}}, "name": "time_distributed_24"}, "inbound_nodes": [[["time_distributed_23", 0, 0, {}]]], "name": "time_distributed_24"}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "Activation", "config": {"trainable": true, "name": "activation_7", "activation": "relu6"}}, "name": "time_distributed_25"}, "inbound_nodes": [[["time_distributed_24", 0, 0, {}]]], "name": "time_distributed_25"}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_regularizer": null, "use_bias": true, "activation": "linear", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "conv2d_7", "data_format": "channels_last", "kernel_size": [1, 1], "bias_regularizer": null, "filters": 24, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_constraint": null, "trainable": true, "padding": "same", "dilation_rate": [1, 1]}}, "name": "time_distributed_26"}, "inbound_nodes": [[["time_distributed_25", 0, 0, {}]]], "name": "time_distributed_26"}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "BatchNormalization", "config": {"scale": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_10", "epsilon": 0.001, "beta_regularizer": null, "center": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "axis": -1}}, "name": "time_distributed_27"}, "inbound_nodes": [[["time_distributed_26", 0, 0, {}]]], "name": "time_distributed_27"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_1"}, "inbound_nodes": [[["time_distributed_27", 0, 0, {}], ["time_distributed_19", 0, 0, {}]]], "name": "add_1"}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_regularizer": null, "use_bias": true, "activation": "linear", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "conv2d_8", "data_format": "channels_last", "kernel_size": [1, 1], "bias_regularizer": null, "filters": 144, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_constraint": null, "trainable": true, "padding": "same", "dilation_rate": [1, 1]}}, "name": "time_distributed_28"}, "inbound_nodes": [[["add_1", 0, 0, {}]]], "name": "time_distributed_28"}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "BatchNormalization", "config": {"scale": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_11", "epsilon": 0.001, "beta_regularizer": null, "center": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "axis": -1}}, "name": "time_distributed_29"}, "inbound_nodes": [[["time_distributed_28", 0, 0, {}]]], "name": "time_distributed_29"}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "Activation", "config": {"trainable": true, "name": "activation_8", "activation": "relu6"}}, "name": "time_distributed_30"}, "inbound_nodes": [[["time_distributed_29", 0, 0, {}]]], "name": "time_distributed_30"}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "DepthwiseConv2D", "config": {"strides": [2, 2], "activity_regularizer": null, "use_bias": true, "trainable": true, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "name": "depthwise_conv2d_4", "data_format": "channels_last", "kernel_size": [3, 3], "depthwise_constraint": null, "bias_regularizer": null, "depthwise_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "padding": "same"}}, "name": "time_distributed_31"}, "inbound_nodes": [[["time_distributed_30", 0, 0, {}]]], "name": "time_distributed_31"}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "BatchNormalization", "config": {"scale": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_12", "epsilon": 0.001, "beta_regularizer": null, "center": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "axis": -1}}, "name": "time_distributed_32"}, "inbound_nodes": [[["time_distributed_31", 0, 0, {}]]], "name": "time_distributed_32"}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "Activation", "config": {"trainable": true, "name": "activation_9", "activation": "relu6"}}, "name": "time_distributed_33"}, "inbound_nodes": [[["time_distributed_32", 0, 0, {}]]], "name": "time_distributed_33"}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_regularizer": null, "use_bias": true, "activation": "linear", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "conv2d_9", "data_format": "channels_last", "kernel_size": [1, 1], "bias_regularizer": null, "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_constraint": null, "trainable": true, "padding": "same", "dilation_rate": [1, 1]}}, "name": "time_distributed_34"}, "inbound_nodes": [[["time_distributed_33", 0, 0, {}]]], "name": "time_distributed_34"}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "BatchNormalization", "config": {"scale": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_13", "epsilon": 0.001, "beta_regularizer": null, "center": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "axis": -1}}, "name": "time_distributed_35"}, "inbound_nodes": [[["time_distributed_34", 0, 0, {}]]], "name": "time_distributed_35"}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_regularizer": null, "use_bias": true, "activation": "linear", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "conv2d_10", "data_format": "channels_last", "kernel_size": [1, 1], "bias_regularizer": null, "filters": 192, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_constraint": null, "trainable": true, "padding": "same", "dilation_rate": [1, 1]}}, "name": "time_distributed_36"}, "inbound_nodes": [[["time_distributed_35", 0, 0, {}]]], "name": "time_distributed_36"}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "BatchNormalization", "config": {"scale": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_14", "epsilon": 0.001, "beta_regularizer": null, "center": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "axis": -1}}, "name": "time_distributed_37"}, "inbound_nodes": [[["time_distributed_36", 0, 0, {}]]], "name": "time_distributed_37"}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "Activation", "config": {"trainable": true, "name": "activation_10", "activation": "relu6"}}, "name": "time_distributed_38"}, "inbound_nodes": [[["time_distributed_37", 0, 0, {}]]], "name": "time_distributed_38"}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "DepthwiseConv2D", "config": {"strides": [1, 1], "activity_regularizer": null, "use_bias": true, "trainable": true, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "name": "depthwise_conv2d_5", "data_format": "channels_last", "kernel_size": [3, 3], "depthwise_constraint": null, "bias_regularizer": null, "depthwise_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "padding": "same"}}, "name": "time_distributed_39"}, "inbound_nodes": [[["time_distributed_38", 0, 0, {}]]], "name": "time_distributed_39"}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "BatchNormalization", "config": {"scale": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_15", "epsilon": 0.001, "beta_regularizer": null, "center": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "axis": -1}}, "name": "time_distributed_40"}, "inbound_nodes": [[["time_distributed_39", 0, 0, {}]]], "name": "time_distributed_40"}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "Activation", "config": {"trainable": true, "name": "activation_11", "activation": "relu6"}}, "name": "time_distributed_41"}, "inbound_nodes": [[["time_distributed_40", 0, 0, {}]]], "name": "time_distributed_41"}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_regularizer": null, "use_bias": true, "activation": "linear", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "conv2d_11", "data_format": "channels_last", "kernel_size": [1, 1], "bias_regularizer": null, "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_constraint": null, "trainable": true, "padding": "same", "dilation_rate": [1, 1]}}, "name": "time_distributed_42"}, "inbound_nodes": [[["time_distributed_41", 0, 0, {}]]], "name": "time_distributed_42"}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "BatchNormalization", "config": {"scale": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_16", "epsilon": 0.001, "beta_regularizer": null, "center": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "axis": -1}}, "name": "time_distributed_43"}, "inbound_nodes": [[["time_distributed_42", 0, 0, {}]]], "name": "time_distributed_43"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_2"}, "inbound_nodes": [[["time_distributed_43", 0, 0, {}], ["time_distributed_35", 0, 0, {}]]], "name": "add_2"}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_regularizer": null, "use_bias": true, "activation": "linear", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "conv2d_12", "data_format": "channels_last", "kernel_size": [1, 1], "bias_regularizer": null, "filters": 192, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_constraint": null, "trainable": true, "padding": "same", "dilation_rate": [1, 1]}}, "name": "time_distributed_44"}, "inbound_nodes": [[["add_2", 0, 0, {}]]], "name": "time_distributed_44"}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "BatchNormalization", "config": {"scale": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_17", "epsilon": 0.001, "beta_regularizer": null, "center": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "axis": -1}}, "name": "time_distributed_45"}, "inbound_nodes": [[["time_distributed_44", 0, 0, {}]]], "name": "time_distributed_45"}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "Activation", "config": {"trainable": true, "name": "activation_12", "activation": "relu6"}}, "name": "time_distributed_46"}, "inbound_nodes": [[["time_distributed_45", 0, 0, {}]]], "name": "time_distributed_46"}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "DepthwiseConv2D", "config": {"strides": [1, 1], "activity_regularizer": null, "use_bias": true, "trainable": true, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "name": "depthwise_conv2d_6", "data_format": "channels_last", "kernel_size": [3, 3], "depthwise_constraint": null, "bias_regularizer": null, "depthwise_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "padding": "same"}}, "name": "time_distributed_47"}, "inbound_nodes": [[["time_distributed_46", 0, 0, {}]]], "name": "time_distributed_47"}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "BatchNormalization", "config": {"scale": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_18", "epsilon": 0.001, "beta_regularizer": null, "center": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "axis": -1}}, "name": "time_distributed_48"}, "inbound_nodes": [[["time_distributed_47", 0, 0, {}]]], "name": "time_distributed_48"}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "Activation", "config": {"trainable": true, "name": "activation_13", "activation": "relu6"}}, "name": "time_distributed_49"}, "inbound_nodes": [[["time_distributed_48", 0, 0, {}]]], "name": "time_distributed_49"}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_regularizer": null, "use_bias": true, "activation": "linear", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "conv2d_13", "data_format": "channels_last", "kernel_size": [1, 1], "bias_regularizer": null, "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_constraint": null, "trainable": true, "padding": "same", "dilation_rate": [1, 1]}}, "name": "time_distributed_50"}, "inbound_nodes": [[["time_distributed_49", 0, 0, {}]]], "name": "time_distributed_50"}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "BatchNormalization", "config": {"scale": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_19", "epsilon": 0.001, "beta_regularizer": null, "center": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "axis": -1}}, "name": "time_distributed_51"}, "inbound_nodes": [[["time_distributed_50", 0, 0, {}]]], "name": "time_distributed_51"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_3"}, "inbound_nodes": [[["time_distributed_51", 0, 0, {}], ["add_2", 0, 0, {}]]], "name": "add_3"}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_regularizer": null, "use_bias": true, "activation": "linear", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "conv2d_14", "data_format": "channels_last", "kernel_size": [1, 1], "bias_regularizer": null, "filters": 192, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_constraint": null, "trainable": true, "padding": "same", "dilation_rate": [1, 1]}}, "name": "time_distributed_52"}, "inbound_nodes": [[["add_3", 0, 0, {}]]], "name": "time_distributed_52"}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "BatchNormalization", "config": {"scale": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_20", "epsilon": 0.001, "beta_regularizer": null, "center": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "axis": -1}}, "name": "time_distributed_53"}, "inbound_nodes": [[["time_distributed_52", 0, 0, {}]]], "name": "time_distributed_53"}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "Activation", "config": {"trainable": true, "name": "activation_14", "activation": "relu6"}}, "name": "time_distributed_54"}, "inbound_nodes": [[["time_distributed_53", 0, 0, {}]]], "name": "time_distributed_54"}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "DepthwiseConv2D", "config": {"strides": [2, 2], "activity_regularizer": null, "use_bias": true, "trainable": true, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "name": "depthwise_conv2d_7", "data_format": "channels_last", "kernel_size": [3, 3], "depthwise_constraint": null, "bias_regularizer": null, "depthwise_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "padding": "same"}}, "name": "time_distributed_55"}, "inbound_nodes": [[["time_distributed_54", 0, 0, {}]]], "name": "time_distributed_55"}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "BatchNormalization", "config": {"scale": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_21", "epsilon": 0.001, "beta_regularizer": null, "center": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "axis": -1}}, "name": "time_distributed_56"}, "inbound_nodes": [[["time_distributed_55", 0, 0, {}]]], "name": "time_distributed_56"}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "Activation", "config": {"trainable": true, "name": "activation_15", "activation": "relu6"}}, "name": "time_distributed_57"}, "inbound_nodes": [[["time_distributed_56", 0, 0, {}]]], "name": "time_distributed_57"}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_regularizer": null, "use_bias": true, "activation": "linear", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "conv2d_15", "data_format": "channels_last", "kernel_size": [1, 1], "bias_regularizer": null, "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_constraint": null, "trainable": true, "padding": "same", "dilation_rate": [1, 1]}}, "name": "time_distributed_58"}, "inbound_nodes": [[["time_distributed_57", 0, 0, {}]]], "name": "time_distributed_58"}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "BatchNormalization", "config": {"scale": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_22", "epsilon": 0.001, "beta_regularizer": null, "center": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "axis": -1}}, "name": "time_distributed_59"}, "inbound_nodes": [[["time_distributed_58", 0, 0, {}]]], "name": "time_distributed_59"}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_regularizer": null, "use_bias": true, "activation": "linear", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "conv2d_16", "data_format": "channels_last", "kernel_size": [1, 1], "bias_regularizer": null, "filters": 384, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_constraint": null, "trainable": true, "padding": "same", "dilation_rate": [1, 1]}}, "name": "time_distributed_60"}, "inbound_nodes": [[["time_distributed_59", 0, 0, {}]]], "name": "time_distributed_60"}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "BatchNormalization", "config": {"scale": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_23", "epsilon": 0.001, "beta_regularizer": null, "center": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "axis": -1}}, "name": "time_distributed_61"}, "inbound_nodes": [[["time_distributed_60", 0, 0, {}]]], "name": "time_distributed_61"}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "Activation", "config": {"trainable": true, "name": "activation_16", "activation": "relu6"}}, "name": "time_distributed_62"}, "inbound_nodes": [[["time_distributed_61", 0, 0, {}]]], "name": "time_distributed_62"}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "DepthwiseConv2D", "config": {"strides": [1, 1], "activity_regularizer": null, "use_bias": true, "trainable": true, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "name": "depthwise_conv2d_8", "data_format": "channels_last", "kernel_size": [3, 3], "depthwise_constraint": null, "bias_regularizer": null, "depthwise_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "padding": "same"}}, "name": "time_distributed_63"}, "inbound_nodes": [[["time_distributed_62", 0, 0, {}]]], "name": "time_distributed_63"}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "BatchNormalization", "config": {"scale": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_24", "epsilon": 0.001, "beta_regularizer": null, "center": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "axis": -1}}, "name": "time_distributed_64"}, "inbound_nodes": [[["time_distributed_63", 0, 0, {}]]], "name": "time_distributed_64"}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "Activation", "config": {"trainable": true, "name": "activation_17", "activation": "relu6"}}, "name": "time_distributed_65"}, "inbound_nodes": [[["time_distributed_64", 0, 0, {}]]], "name": "time_distributed_65"}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_regularizer": null, "use_bias": true, "activation": "linear", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "conv2d_17", "data_format": "channels_last", "kernel_size": [1, 1], "bias_regularizer": null, "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_constraint": null, "trainable": true, "padding": "same", "dilation_rate": [1, 1]}}, "name": "time_distributed_66"}, "inbound_nodes": [[["time_distributed_65", 0, 0, {}]]], "name": "time_distributed_66"}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "BatchNormalization", "config": {"scale": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_25", "epsilon": 0.001, "beta_regularizer": null, "center": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "axis": -1}}, "name": "time_distributed_67"}, "inbound_nodes": [[["time_distributed_66", 0, 0, {}]]], "name": "time_distributed_67"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_4"}, "inbound_nodes": [[["time_distributed_67", 0, 0, {}], ["time_distributed_59", 0, 0, {}]]], "name": "add_4"}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_regularizer": null, "use_bias": true, "activation": "linear", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "conv2d_18", "data_format": "channels_last", "kernel_size": [1, 1], "bias_regularizer": null, "filters": 384, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_constraint": null, "trainable": true, "padding": "same", "dilation_rate": [1, 1]}}, "name": "time_distributed_68"}, "inbound_nodes": [[["add_4", 0, 0, {}]]], "name": "time_distributed_68"}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "BatchNormalization", "config": {"scale": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_26", "epsilon": 0.001, "beta_regularizer": null, "center": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "axis": -1}}, "name": "time_distributed_69"}, "inbound_nodes": [[["time_distributed_68", 0, 0, {}]]], "name": "time_distributed_69"}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "Activation", "config": {"trainable": true, "name": "activation_18", "activation": "relu6"}}, "name": "time_distributed_70"}, "inbound_nodes": [[["time_distributed_69", 0, 0, {}]]], "name": "time_distributed_70"}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "DepthwiseConv2D", "config": {"strides": [1, 1], "activity_regularizer": null, "use_bias": true, "trainable": true, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "name": "depthwise_conv2d_9", "data_format": "channels_last", "kernel_size": [3, 3], "depthwise_constraint": null, "bias_regularizer": null, "depthwise_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "padding": "same"}}, "name": "time_distributed_71"}, "inbound_nodes": [[["time_distributed_70", 0, 0, {}]]], "name": "time_distributed_71"}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "BatchNormalization", "config": {"scale": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_27", "epsilon": 0.001, "beta_regularizer": null, "center": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "axis": -1}}, "name": "time_distributed_72"}, "inbound_nodes": [[["time_distributed_71", 0, 0, {}]]], "name": "time_distributed_72"}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "Activation", "config": {"trainable": true, "name": "activation_19", "activation": "relu6"}}, "name": "time_distributed_73"}, "inbound_nodes": [[["time_distributed_72", 0, 0, {}]]], "name": "time_distributed_73"}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_regularizer": null, "use_bias": true, "activation": "linear", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "name": "conv2d_19", "data_format": "channels_last", "kernel_size": [1, 1], "bias_regularizer": null, "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_constraint": null, "trainable": true, "padding": "same", "dilation_rate": [1, 1]}}, "name": "time_distributed_74"}, "inbound_nodes": [[["time_distributed_73", 0, 0, {}]]], "name": "time_distributed_74"}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "BatchNormalization", "config": {"scale": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_28", "epsilon": 0.001, "beta_regularizer": null, "center": true, "gamma_regularizer": null, 